export const lang = {
	//公共翻译
	common: {
		加载错误: "加载错误",
		加载中: "加载中...",
		没有更多: "没有更多",
		哎呀: "哎呀!",
		还没有数据: "还没有数据",
		请登陆后再进行操作: "请登陆后再进行操作!",
		暂无数据: "暂无数据",
	},

	// 体育
	sports: {
		最多选择场比赛: "最多选择{value}场比赛",
		全场让球: "全场让球",
		全场单双: "全场单双",
		全场大小: "全场大小",
		全场独赢: "全场独赢",
		半场让球: "半场让球",
		半场大小: "半场大小",
		半场独赢: "半场独赢",
		半场单双: "半场单双",
		全场胜负: "全场胜负",
		半场胜负: "半场胜负",
		局数获胜: "局数获胜",
		中场休息: "中场休息",
		延迟开赛: "延迟开赛",
		全场让分: "全场让分",
		即将开赛: "即将开赛",
		上半场: "上半场",
		下半场: "下半场",
		第一节: "第一节",
		第二节: "第二节",
		第三节: "第三节",
		第四节: "第四节",
		加时赛: "加时赛",
		第一盘: "第一盘",
		第二盘: "第二盘",
		第三盘: "第三盘",
		第四盘: "第四盘",
		第五盘: "第五盘",
		第一局: "第一局",
		第二局: "第二局",
		第三局: "第三局",
		第四局: "第四局",
		第五局: "第五局",
		第六局: "第六局",
		第七局: "第七局",
		第八局: "第八局",
		第九局: "第九局",
		延长赛: "延长赛",
		星期一: "星期一",
		星期二: "星期二",
		星期三: "星期三",
		星期四: "星期四",
		星期五: "星期五",
		星期六: "星期六",
		星期日: "星期日",
		virtualKeyboard: {
			最大: "最大",
			最小: "最小",
		},
	},

	pagination: {
		总计: "总计{value}项",
	},

	//游戏列表
	gameList: {
		提示: "提示",
		请登陆后再进行收藏: "请登陆后再进行收藏。",
		最近浏览: "最近浏览",
		查看全部: "查看全部",
		排序方式: "排序方式",
		你可能喜欢: "你可能喜欢",
		提供者: "提供者",
		游戏供应商: "游戏供应商",
		查看所有提供商: "查看所有提供商",
		游戏: "游戏",
		收藏夹: "收藏夹",
		为你推荐: "为你推荐",
		最受欢迎的: "最受欢迎的",
		最新的: "最新的",
		游戏备注: "游戏备注",
		gameCard: {
			维护时间: "维护时间",
			维护中: "维护中",
		},
	},

	// 赛果
	matchResult: {
		日期: "日期",
		联赛: "联赛",
		赛事: "赛事",
		滚球: "滚球",
		搜索联赛: "搜索联赛",
		搜索赛事: "搜索赛事",
		全场大小: "全场大小",
	},

	// 竞猜记录
	bettingRules: {
		竞猜规则: "竞猜规则",

		generalSportsInstructions: {
			title: "全部规则",
			section: {
				0: {
					title: "概述",
					desc: "此规则与条款将适用于本公司所有的投注种类。会员们有责任确保您获知所有的规则与条款，我们保留随时修改条款的权利，并且会将修改的内容公布在本网站上。公布在网站公告上的信息可作为投注附加的规则与条款，若有任何差异或矛盾的地方，将以附加信息为准。本公司对此条款视为公平公正的，若您有任何意见或疑问，您可以联络我们的客服部，我们的客服团队将热诚协助每位客户，并确保能及时友善的解决您的问题。对于任何错误或争论，我们的客服团队将竭力提供服务。所有的条款用于在会员与公司之间建立一般的原则。对产生的任何争议，希望通过该条款让双方都得到满意的解决方案。",
				},
				1: {
					title: "一般体育规则",
					desc: "所有在本公司进行的投注都需要依照以下规则与条款处理。在个别体育项目里注明的规则将视为体育主要规则:",
					list: {
						0: "所有投注项目的最高和最低投注额将由公司决定，如有任何更改无需提前通知。",
						1: "会员申请账户时需提供正确的个人信息，本公司对提供伪造或错误信息的账户将不负任何责任。",
						2: '会员将全权负责账户提交的所有交易。在投注前请仔细检查选项，一旦投注提交成功后，将无法更改或取消。公司对会员自身原因造成的遗漏或重复投注不负任何责任。会员可以在"交易记录"中查看详情确保所有提交的注单已成功。',
						3: "在任何投诉中，如果在公司的数据库中没有存储任何记录，公司将不接受也不认可任何会员提供的复印件或单据。",
						4: "公司保留在任何时候关闭或冻结会员账号的权利。",
						5: "公司保留在任何时候暂停/中止会员对任何盘口进行投注的权利。",
						6: '公司保留对已预先知道赛果的投注作出取消的权利。如果由于"滚球现场"延迟而引起盘口的赔率错误，此期间的注单将视为无效。',
						7: "赛事时间,计时器和红牌等信息仅供会员参考，公司对提供此信息的准确性不负任何责任。",
						8: "如果比赛或赛事取消，中断或延迟并且没有在官方指定开球时间的36小时内重新开始，所有该场赛事的投注即被视为无效且取消，除非在个别体育规则里另有指定注明。某些无条件终止的盘口将会相应地结算。单独的体育规则中对此类盘口的结算程序做了说明。 公司取消该赛事所有注单的结果被视为最终决定，无需参考官方赛事裁判或相关部门的决定。连串投注将会继续按照注单剩余赛事的赛果结算，该取消赛事的赔率将会按照1计算。",
						9: "如果比赛或是赛事取消，所有该场赛事的投注即被视为无效且取消，除非在个别体育规则里另有指定注明。对于取消的定义和处理本公司拥有最终解释权。",
						10: "如果对其它语言版本的信息或球赛队名有争议，请以英文网站的名称为准。",
						11: "由以下事件造成的任何损失，公司不赋予任何责任: ",
						"11_0": "a.公司的网站、服务器或网络中断。",
						"11_1": "b.公司数据库、服务器丢失信息或信息遭受破坏。",
						"11_2": "c.不法分子攻击网站、服务器或网络供应商。",
						"11_3": "d.进入网站时由于网络供应商原因造成的网络缓慢。",
						12: "如果对此规则与条款的内容有任何疑义，请以公司的解释为准。",
					},
				},
				2: {
					title: "赛果与派彩",
					desc: "",
					list: {
						0: "赛果均在赛事结束后判定，除非在个别体育规则里另有注明。赛果公布72小时后，若对任何赛果有争议，本公司将不认可。在赛果公布72小时内,除了任何体育纪律委员会所重新裁决之赛果，本公司只会修正人为、系统或参考赛果的相关网页失误等原因的错误。",
						1: "投注通常在赛事结束后派彩。但考虑到会员的利益，某些投注会在官方公布赛事结果之前就进行派彩。为此，公司保留对此而造成的错误进行更改的权利。",
						2: "派彩是根据官方来源或相关体育权威机构判定的结果为准。",
						3: "所有的交易将以公司最新备份数据记录为准，公司不接纳任何投诉或争议，除非会员提供交易记录的截图或影印证据，否则公司的数据记录将作为最终证明。",
					},
				},
				3: {
					title: "滚球类型投注规则",
					desc: "滚球投注是指对正在进行比赛的赛事进行投注。注单会在赛事进行比赛后开始接收并且在盘口关盘后停止所有交易。个别体育会开出多个滚球种类的盘口供投注。",
					list: {
						0: "所有滚球投注均需要遵守系统验收程序。这可能会导致每笔投注延迟确认或出现投注失败的情况。,除了任何体育纪律委员会所重新裁决之赛果，本公司只会修正人为、系统或参考赛果的相关网页失误等原因的错误。",
						1: "所有在注单上显示“待确认”的字眼则表示注单正在等待系统的判断投注是否成功。这表示注单在等待被确认或可能被取消。",
						2: "在赛事有事件发生或出现其他特殊情况时，所有待确认中的注单将不被确认并视为投注失败。此事件可包含进球，红卡，点球或技术上问题等等。(其他例子并不一一详尽列出) 。",
						3: "当有重大事件发生时，会应用电视裁判助理（VAR）来判定，这可能会导致之前已确定的注单被取消。注单被取消始于重大事件发生的开端直到VAR的最终官方判定已宣布。",
					},
				},
			},
		},

		championDescription: {
			title: "冠军",
			section: {
				0: {
					title: "概述",
					desc: "在指定的冠军盘中，预测一场锦标赛, 联赛, 或者比赛的冠军。所选择的队伍或选手获得最终胜利视为符合派彩条件，包括：",
					list: {
						0: "联赛的最终结果，例如: 世界杯冠军或F1车手冠军。",
						1: "在预赛中胜出，例如: 世界杯小组冠军。",
						2: "在最后一场赛事中，例如: 能否出线，能否踢加时，能否踢点球。",
						3: "比赛的最终结果，例如：F1赛事的个人冠军。",
						4: "最高得分数。",
						5: "最优秀的选手等。",
					},
				},
				1: {
					title: "一般规则",
					desc: "",
					list: {
						0: "联赛的派彩将以官方来源或相关体育权威机构判定的结果为准。",
						1: "无论挑选的人或球队是否有参与，所有冠军投注都视为有效。",
						2: "并列名次规则适用于冠军投注市场。",
						3: "无论在什么情况下，如果名称使用“任何其他球员”或“任何其他球队” 将被视为代替无名称的参赛者。",
						4: "如果体育项目有开出特殊规则，则其将取代一般适用规则。",
						5: "冠军项目月份榜首榜尾结算规则: 此项目计算方式于该月第一日至最后一日（英国时间23: 59），如遇最后一日赛事延赛或赛事取消则不予计算，不影响该项目的计算。延迟或取消的赛事不予计算，如果由于人为错误或技术故障，赛果出来后盘口没有关闭，公司有权取消因此错误下注的注单。",
						6: "足球冠军投注仅适用于常规赛季（除非另作说明）。整个赛季赛程结束后球队最终的排名来决定冠军。季后赛或随后查询(潜在扣分)各自联赛将不计算在最终赛果。",
					},
				},
			},
		},

		winAndRules: {
			title: "独赢及规则",
			section: {
				0: {
					title: "概述",
					desc: "",
					list: {
						0: "独赢及位置的投注是由两个独立的投注注单(同等投注金额)组成的一个选项。",
						1: "如选项赢，则会员可获得独赢及位置两部分的相应本金及赢利。",
						2: "如所选项仅赢得位置的胜利，会员依然可获得位置部分本金及赢利。",
						3: "确认下注后，此注单将会分为两个部分显示：“赢”以及“位置”。",
						4: "项目的不同，对其 “位置（名次和赔率）”的设定标准不同，因此产生的赢利或有不同。",
						5: "位置项目可理解如下：1/4赔率-前三名。这意味着所选对象如能成功进入前三位，位置项目的投注额（即总投注额的一半）的初始赔率的四分之一奖金将会进入会员账户。位置的标准会有不同设定，如1/5 – 前5名 或 1/5-前7名等。",
						6: "独赢及位置的投注可能性结果如下：",
						"6_0": "a.独赢及位置选项结果为胜",
						"6_1": "b.赢的选项为输，位置选项为胜",
					},
				},
				1: {
					title: "一般规则",
					desc: "",
					list: {
						0: "独赢及位置的选项仅针对于部分盘口。该项目的一般规则将同样应用于此项投注。",
						1: "独赢及位置的选项（位置和赔率）会根据体育项目的进展而变化。如：高尔夫球赛。当前投注的独赢及位置的选项注单不会因为对应高尔夫球赛未来的进展而被改变。",
						2: "如参赛人数无法满足独赢及位置的选项的要求，则此投注项目将被取消。如：原定5名参赛者的赛事中，只有3人参加。",
						3: "所有赛事参赛者（队）满足独赢及位置的选项条件，方可连串下注（双式投注、三式投注等）。所选项的独赢及位置的连串结果需以 “独赢-独赢”和“位置-位置”为准，两项不能混合。如：两个连串选项的结果中只有一个“赢”和“位置”选项获胜，则此连串注单结果中，“独赢-独赢”结果为输；“位置-位置”结果则赢。",
						4: "多冠军规则同样应用于独赢及位置的投注。",
					},
				},
			},
		},

		advanceSettlementRules: {
			title: "提前结算规则",
			section: {
				0: {
					title: "一般规则",
					desc: "提前结算的规则上需要加修改",
					list: {
						0: "提前结算只适用于指定的赛事及盘口类型。",
						1: "提前结算功能可能随时被取消或者是被调整，不是一直都存在的。",
						2: "提前结算所获得的金额是不可修改的。本公司也不会对这个金额做任何的解释。",
						3: "对于部分提前结算，注单的提前结算部分需要不小于该种类型的提前结算最小限额。",
						"3_0": "例1 -最小限额= 1.00 /客户投注= 100.00，投注则可在1.00 - 99.00范围内结束投注。",
						"3_1": "例2 -最小限额= 1.00 /客户投注= 5.00，投注则可在1.00 - 4.00范围内结束投注。",
						"3_2": "例3 -最小限额= 1.00 /客户投注= 1.00，注单无法进行部分提前结算，但是注单是可以进行全部提前结算的。",
						4: "系统设定有同一笔订单部分提前结算的次数，且可能在任何时间进行调整。",
						5: "所有注单在提前结算时显示的金额就是提前结算成功后将会返回到您账户的金额。这包含了与提前结算金额相关的投注本金。",
						"5_0": "例1 -如果结束投注金额显示为1500 .00，而相关投注金额为1000 .00，则已确认的赢/亏为+ 500.00(赢)",
						"5_1": "例2 -如果结束投注金额显示的是800.00，而相关投注金额为1000.00，则确认的赢/亏为- 200.00(亏)",
						6: "对于预约提前结算，当设置的预约提前结算条件达成时（本金、派彩额），系统自动提前结算订单。如果预约的订单被结算或被取消，则预约提前结算失效。",
						"6_0": "例1 -如果预约投注金额为100 .00，预约返还额为200.00，则提前结算返还额达到200.00时，系统自动提前结算订单，如果订单被结算或被取消，则该预约提前结算订单自动失效。",
					},
				},
				1: {
					title: "结算规则",
					desc: "",
					list: {
						0: "如果赛事被取消或延期，本公司保留取消及撤销先前已提前结算的投注的权利，除非盘口已无条件确定。",
						1: "如果赛事被中断，且未能在36小时内继续，本公司保留取消及撤销先前已提前结算的投注的权利，除非盘口已无条件决定。",
						2: "如果已提前结算的投注被取消，本公司保留取消该投注及收回提前结算资金的权利。",
					},
				},
			},
		},

		americanSoccer: {
			title: "美式足球",
			section: {
				0: {
					title: "一般规则",
					desc: "",
					list: {
						0: "最终赛果是以全场四个时节后的比分为准（包括加时赛）。",
						1: "如果投注的球队没有参与比赛，所有投注此球队的注单（排除冠军盘口）将被取消。",
						2: "海外（到其他国家）所举办的热身交流赛，无主/客队之区别，注单仍视为有效。",
						3: "单节/半场的投注，必须在比赛赛节完成后注单才被视为有效。",
						4: "第四节投注不包括加时赛。",
						5: "美国大学美式足球联赛场地规则：盘口指示的'主场'和'客场'信息仅供参考。无论原定场地是否更改为'主场'，'客场'或'中立场'，所有注单将保持有效。",
						6: "除非个别玩法规则另有注明，赛事完场时间将包括加时赛。",
						7: "如果比赛提前开赛，仅接受开赛前所投注的注单视为有效投注。开赛后投注的注单将被视为无效投注，滚球玩法除外。",
						8: "所有玩法的投注，如若已有明确赛果，所有相关投注将予以结算。",
					},
				},
				1: {
					title: "投注类型",
				},
				2: {
					title: "胜负",
					desc: "",
					list: {
						0: "预测哪一支球队将在比赛胜出。盘口提供两支球队为投注选项。",
					},
				},
				3: {
					title: "独赢（两项）",
					desc: "",
					list: {
						0: "预测哪一支球队将在比赛胜出。但若比赛结果为平局，所有投注将被取消。",
						1: "赛事盘口包括全场、半场或单节投注。",
					},
				},
				4: {
					title: "让球",
					desc: "",
					list: {
						0: "预测哪一支球队在盘口指定的让分数赢得某个时节或全场比赛。",
						1: "滚球结算是以0-0的比分在比赛结束后按盘口开出的让分数做裁决。投注当时的比分对结算没有影响。",
					},
				},
				5: {
					title: "大/小",
					desc: "",
					list: {
						0: "预测赛事总比分将大于或小于在盘口指定的大/小盘分数。",
						1: "滚球结算是以0-0的比分在比赛结束后按盘口开出的让分数做裁决。",
					},
				},
				6: {
					title: "球队进球大小",
					desc: "",
					list: {
						0: "预测赛事/赛节某个球队总进球数将大于或小于盘口分数。",
						1: "如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大小球投注的注单才会被结算。若遇到任何其他情况，注单将一律被取消。",
					},
				},
				7: {
					title: "单双",
					desc: "",
					list: {
						0: "预测赛事指定阶段的总比分是单数或双数。",
					},
				},
				8: {
					title: "球队单双",
					desc: "",
					list: {
						0: "预测赛事主队/客队的分数是单数或双数。",
						1: "赛事盘口包括全场、半场或单节投注。",
					},
				},
				9: {
					title: "半/全场胜平负",
					desc: "",
					list: {
						0: "预测赛事半/全场结果。加时赛不包括在内。",
						1: "全场结果包括和局。",
					},
				},
				10: {
					title: "得分最高的节",
					desc: "",
					list: {
						0: "预测最高得分的单节。",
						1: "加时赛不计算在内。",
						2: "如果赛事中断，所有最高得分单节的注单将被视为无效。",
						3: "如果两个或更多赛节出现相同最高得分，则“平局”将被结算为获胜。",
					},
				},
				11: {
					title: "得分最高的半场",
					desc: "",
					list: {
						0: "预测最高得分的半场。",
						1: "加时赛不计算在内。",
						2: "如果赛事中断，所有最高得分半场的注单将被视为无效。",
					},
				},
				12: {
					title: "比赛会有加时",
					desc: "",
					list: {
						0: "预测一场比赛是否会有加时赛。",
					},
				},
				13: {
					title: "最先获得X分的球队",
					desc: "",
					list: {
						0: "预测最先获得X分的球队。",
						1: "如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，注单才会被结算。若遇到任何其他情况，注单将一律被视为无效。",
						2: "如果都没有球队获得X分，所有最先获得X分的球队的注单将被取消。",
						3: "取决于赛事的情况，玩法指定的分数可能有变化，并且此信息会清楚的显示在盘口。",
					},
				},
				14: {
					title: "达阵得分大小",
					desc: "",
					list: {
						0: "预测赛事达阵得分数量将大于或小于在盘口指定的大/小盘数。",
					},
				},
				15: {
					title: "射门得分大小",
					desc: "",
					list: {
						0: "预测赛事射门得分数量将大于或小于在盘口指定的大/小盘数。",
					},
				},
				16: {
					title: "第X个射门球队",
					desc: "",
					list: {
						0: "预测第X个射门的球队。",
						1: "如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，注单才会被结算。若遇到任何其他情况，注单将一律被视为无效。",
						2: "如果都没有球队获得第X个射门，则注单将被视为无效。",
					},
				},
				17: {
					title: "下一个得分球队",
					desc: "",
					list: {
						0: "预测下一个得分的球队。",
						1: "如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，注单才会被结算。若遇到任何其他情况，注单将一律被视为无效。",
						2: "如果都没有球队获得下一个得分，则选项”无”获胜。",
					},
				},
				18: {
					title: "下一个得分类型",
					desc: "",
					list: {
						0: "预测下一个得分的类型。",
						1: "如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，注单才会被结算。若遇到任何其他情况，注单将一律被视为无效。",
						2: "如果没有球队获得下一个得分，则选项”无”获胜。",
					},
				},
			},
		},

		tennis: {
			title: "网球",
			section: {
				0: {
					title: "一般规则",
					desc: "",
					list: {
						0: "如果比赛场地的表面有变更，所有投注的注单将被取消。",
						1: "所有投注的注单均在比赛结束后才被视为有效，除非另有注明。",
						2: "如果投注的球员没有参与比赛，所有投注此球员的注单（排除独赢）将被取消。",
						3: "如果一名球员或组合在比赛未结束前退出或被取消资格，所有该场比赛的注单将被取消，除非另有注明。",
						4: "如果比赛预定时间缩短或者需获胜比赛的比分提高，所有注单将被取消。",
						5: "如果赛事延期或中断，只要比赛最后有完成，所有投注将保持有效。",
						6: "如果赛事开出单局或单盘的盘口，而球员在赛事的某局或某盘退出或被取消资格，所有投注此局或此盘的注单将被取消，除非另有注明。",
						7: "如果比赛在法定时间提前进行，在比赛开始前的投注依然有效，在比赛开始后的所有投注均视为无效(滚球投注另作别论)。",
						8: "在决胜盘中，超级抢十被视为一局。",
						9: "网球大满贯（四大公开赛：澳洲网球公开赛、美国网球公开赛、法国网球公开赛、温布顿网球公开赛 ），比赛结算方式:",
						"9_0": "a.男子组比赛：五盘中先赢三盘的球员，为胜方。",
						"9_1": "b.女子组比赛：三盘中先赢两盘的球员，为胜方。",
					},
				},
				1: {
					title: "独赢盘",
					desc: "",
					list: {
						0: "预测哪一位球员在盘口指定的让盘数赢得比赛。",
					},
				},
				2: {
					title: "让盘",
					desc: "",
					list: {
						0: "预测哪一位球员在盘口指定的让盘数赢得比赛。",
					},
				},
				3: {
					title: "让局",
					desc: "",
					list: {
						0: "预测哪一位球员在盘口指定的让局数在某个时节（例如:全场比赛/第一盘/第二盘）赢得最多局。",
						1: "决胜局(抢七局)将视为一局。",
					},
				},
				4: {
					title: "局获胜者（获胜者 – 盘X 局 X）",
					desc: "",
					list: {
						0: "预测指定盘的指定局谁将获胜（例如第一盘第一局）。",
						1: "抢七决胜局将视为一局（例如第一盘第十三局）。",
						2: "如果某盘没有进行指定局，则该局所有注单将被取消。（例如第一盘第八局，但是该盘结束于1-6）。",
						3: "如果一名球员退出或被取消资格，任何没有最终获胜者的局的所有注单将被取消，已结束局的注单将视为有效。",
					},
				},
				5: {
					title: "总局数： 大 / 小",
					desc: "",
					list: {
						0: "预测比赛中的某个时节（例如:全场比赛/第一盘/第二盘）进行的总局数将大于或小于在盘口指定的大/小盘局数。",
						1: "决胜局(抢七局)将视为一局。",
						2: "如果比赛中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大/小盘注单才会被结算。若遇到任何其他情况，注单将一律被取消。",
					},
				},
				6: {
					title: "总局数： 单 / 双",
					desc: "",
					list: {
						0: "预测比赛中的某个时节（例如:全场比赛/第一盘/第二盘）进行的总局数是单数或双数。",
						1: "决胜局(抢七局)将视为一局。",
					},
				},
				7: {
					title: "单盘投注",
					desc: "",
					list: {
						0: "预测单盘最终结果。",
						1: "投注的注单只有在单盘结束后才被视为有效。",
						2: "如果球员在某盘未结束前退出或被取消资格，所有投注此盘的注单将被取消。",
					},
				},
				8: {
					title: "波胆",
					desc: "",
					list: {
						0: "预测比赛的每盘比分。",
					},
				},
				9: {
					title: "总得分-大/小",
					desc: "",
					list: {
						0: "预测提名的球员在某一特定的时间段内的个人总得分将大于或小于盘口指定的总分数线。",
						1: "提供的时间段可能包含局，单盘及整场比赛。",
						2: "注单的结算将根据ATP / WTA公布的结果为准。",
					},
				},
			},
		},

		iceHockey: {
			title: "冰球",
			section: {
				0: {
					title: "一般规则",
					desc: "",
					list: {
						0: "如果原定比赛场地更改，所有的投注将被视为无效。",
						1: "在罚球中，获胜方会在赛事结束后的最终比分上加一分。",
						2: "在赛节投注中，特殊的赛节必须全部完成则注单才被视为有效，除非有明确说明或者个别投注规则。其他情况下，注单将一律取消。",
						3: "第三节赛节投注不包括加时赛和罚球赛。",
						4: "如果比赛提前开赛，只有在开赛之前投注的注单被视为有效投注。在开赛后投注的注单将被视为无效投注，滚球投注类型不包括在内。",
						5: "除了在有特别说明的情况下,加时赛并不计算在内。",
					},
				},
				1: {
					title: "冠军",
					desc: "",
					list: {
						0: "预测哪支球队将赢得比赛。",
					},
				},
				2: {
					title: "1 X 2（独赢）",
					desc: "",
					list: {
						0: "预测哪支球队将赢得比赛/赛节。盘口提供两支球队和平局为投注选项。加时赛并不计算在内。",
					},
				},
				3: {
					title: "让球",
					desc: "",
					list: {
						0: "预测哪支球队将获得让球比赛/赛节的胜利。",
					},
				},
				4: {
					title: "滚球让球",
					desc: "",
					list: {
						0: "预测哪支球队将获得让球比赛/赛节的胜利。",
					},
				},
				5: {
					title: "大/小(球)",
					desc: "",
					list: {
						0: "预测赛事/赛节总进球数将大于或小于盘口分数。",
						1: "如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大小球投注的注单才会被结算。若遇到任何其他情况，注单将一律被取消。",
					},
				},
				6: {
					title: "滚球大/小（球）",
					desc: "",
					list: {
						0: "预测赛事/赛节总进球数将大于或小于盘口分数。",
						1: "如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大小球投注的注单才会被结算。若遇到任何其他情况，注单将一律被取消。",
					},
				},
				7: {
					title: "单/双",
					desc: "",
					list: {
						0: "预测赛事/赛节总进球数为单或者双。",
					},
				},
				8: {
					title: "最先进球球队",
					desc: "",
					list: {
						0: "预测哪支球队将最先得分。",
						1: "无论赛事在任何时间点取消，只要有一队在赛事取消前已经得分，所有的投注将被视为有效。",
						2: "如果在赛事取消时未有任何一方得分，所有的注单将一律被取消。",
					},
				},
				9: {
					title: "最后进球球队",
					desc: "",
					list: {
						0: "预测哪支球队将最后得分。",
						1: "如果在赛事取消时未有任何一方得分，所有的注单将一律被取消。",
					},
				},

				10: {
					title: "球队最高得分的赛节",
					desc: "",
					list: {
						0: "预测哪支球队在一场赛事中将获得最高的赛节得分。",
						1: "加时赛不计算在内。",
						2: "如果赛事取消，所有注单将一律被取消。",
						3: "如果赛事在3节正常比赛时间结束后未有任何一队得分，所有的注单将一律被取消。",
					},
				},
			},
		},

		billiards: {
			title: "斯诺克/台球",
			section: {
				0: {
					title: "一般规则",
					desc: "",
					list: {
						0: "所有注单都以全场赛事结束视为有效，除非另有注明。",
						1: "如果投注的球员没有参与比赛，所有投注此球员的注单（排除冠军盘口）将被取消。",
						2: "如果一名球员在比赛结束前弃权或被取消参赛资格，所有此赛事的投注将被视为无效，除非个别投注类型规则另有特别说明。",
						3: "如果比赛提前开赛，仅有在开赛的前投注的注单将为视为有效投注。开赛后投注的注单将被视为无效，滚球玩法除外。",
						4: "若相关联赛为多日制赛事，期间相关赛事中断或延迟并未在官方指定开球时间的36小时内复赛，所有该场赛事已有明确赛果的投注将予以结算，其馀视为无效。",
						5: "所有玩法的投注，如若已有明确赛果，所有相关投注将予以结算。",
					},
				},
				1: {
					title: "独赢盘",
					desc: "",
					list: {
						0: "预测哪个球员将赢取比赛胜利。这个比赛包含双方球员。",
					},
				},
				2: {
					title: "让局",
					desc: "",
					list: {
						0: "预测哪个球员将在指定的让局比赛获得胜利。",
					},
				},
				3: {
					title: "总局数： 大/小",
					desc: "",
					list: {
						0: "预测一场比赛的总比分是大于还是小于指定盘口。",
						1: "如果一场赛事中断，大/小投注仅会结算任何将来的潜在得分不会影响到赛果的投注。任何其他的情况，投注将被视为无效。",
					},
				},
				4: {
					title: "总局数： 单/双",
					desc: "",
					list: {
						0: "预测一场赛事的总比分是单数还是双数。",
					},
				},
				5: {
					title: "独赢-第X局",
					desc: "",
					list: {
						0: "预测哪个选手将赢取一局比赛的胜利。这个比赛包含双方选手。",
					},
				},

				6: {
					title: "让分-第X局",
					desc: "",
					list: {
						0: "预测哪个选手将在指定的让分比赛获得一局比赛的胜利。",
					},
				},
				7: {
					title: "总分大小-第X局",
					desc: "",
					list: {
						0: "预测一局比赛的总分是大于还是小于指定盘口。",
						1: "如果一局比赛中断，大/小投注仅会结算任何将来的潜在得分不会影响到赛果的投注。任何其他的情况，投注将被视为无效。",
					},
				},
				8: {
					title: "总分单双-第X局",
					desc: "",
					list: {
						0: "预测一局比赛的总分是单数还是双数。",
					},
				},
				9: {
					title: "最先赢得X局的选手",
					desc: "",
					list: {
						0: "预测哪一位选手在赛事中最先达赢得指定的局数。",
						1: "如果一名选手退出或被取消资格，没有最终获胜者的所有注单将被取消，已结束的注单将视为有效。",
					},
				},
				10: {
					title: "剩余时间获胜",
					desc: "",
					list: {
						0: "预测滚球时，哪一位选手在剩余的比赛时间胜出。",
					},
				},
				11: {
					title: "比赛会有决胜局",
					desc: "",
					list: {
						0: "预测一场比赛是否会有决胜局。",
					},
				},
				12: {
					title: "最先获得X分的选手",
					desc: "",
					list: {
						0: "预测一局比赛最先得X分的选手。",
						1: "如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，注单才会被结算。若遇到任何其他情况，注单将一律被视为无效。",
						2: "如果都没有选手获得X分，所有注单将被视为无效。。",
					},
				},
				13: {
					title: "单杆最高得分选手",
					desc: "",
					list: {
						0: "预测哪一位选手在赛事中单杆得分最高。",
					},
				},
				14: {
					title: "独赢（三项）",
					desc: "",
					list: {
						0: "预测哪个选手将在比赛中胜出或赛事和局。盘口提供两位选手以及和局为投注选项。",
					},
				},
				15: {
					title: "单杆得分50分或更多",
					desc: "",
					list: {
						0: "预测在赛事中是否有单杆得分50分或更多。",
						1: "如果出现第1局开始却未完成的情况，则投注将被视为无效，除非特定盘口的结果已确定。",
					},
				},
				16: {
					title: "单杆得分100分或更多",
					desc: "",
					list: {
						0: "预测在赛事中是否有单杆得分100分或更多。",
						1: "如果出现第1局开始却未完成的情况，则投注将被视为无效，除非特定盘口的结果已确定。",
					},
				},
				17: {
					title: "前X局胜平负",
					desc: "",
					list: {
						0: "预测哪个选手将在前X局的比赛中胜出或和局。盘口提供两位选手以及和局为投注选项。",
					},
				},
				18: {
					title: "是否会有犯规",
					desc: "",
					list: {
						0: "预测一局比赛中是否会出现选手犯规。",
					},
				},
				19: {
					title: "打第X个球的选手",
					desc: "",
					list: {
						0: "预测一局比赛中打第X个球的选手。",
					},
				},
				20: {
					title: "打最后一球的选手",
					desc: "",
					list: {
						0: "预测一局比赛中打第最后一个球的选手。",
					},
				},
				21: {
					title: "最后得分的类型",
					desc: "",
					list: {
						0: "预测一局比赛中最后得分的类型。",
					},
				},
				22: {
					title: "正确比分",
					desc: "",
					list: {
						0: "预测一个特定赛事全场的正确比分。",
						1: "结算将依据相关部门最终公布的比分为准。",
					},
				},
				23: {
					title: "打满比赛",
					desc: "",
					list: {
						0: "此规则适用于所有比赛，例如：”打满八局”比赛最终结果可能是7-1或者4-4等。",
					},
				},
			},
		},

		volleyball: {
			title: "排球",
			section: {
				0: {
					title: "一般规则",
					desc: "",
					list: {
						0: "所有注单都以全场赛事结束视为有效，除非另有特别说明。",
						1: "赛事是五局三胜制，所有的投注都将以最先赢得三局的球队为准。",
						2: "如果比赛持续时间缩短或比赛要求提高获胜比分，所有注单将被视为无效。",
						3: "如果比赛提前开赛，仅有在开赛之前投注的注单将为视为有效投注。开赛后投注的注单将被视为无效， 滚球玩法除外。",
					},
				},
				1: {
					title: "独赢盘",
					desc: "",
					list: {
						0: "预测哪个球员将会赢取比赛的胜利。这个比赛包含双方球员。",
					},
				},
				2: {
					title: "让盘 / 让局",
					desc: "",
					list: {
						0: "预测哪一位球员在盘口指定的让盘/局数赢得比赛。",
					},
				},
				3: {
					title: "总盘/总局数： 大 / 小",
					desc: "",
					list: {
						0: "预测比赛进行的总盘/局数是大于或小于盘口指定的大小盘局数。",
					},
				},
				4: {
					title: "让分",
					desc: "",
					list: {
						0: "预测在某个时节 哪一位球员在盘口指定的让分数赢得比赛。",
						1: "如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大/小盘注单才会被结算。若遇到任何其他情况，注单将一律被取消。",
					},
				},
				5: {
					title: "总分： 大 / 小",
					desc: "",
					list: {
						0: "预测在某个时节 预测提名的球员在某一特定的时间段内的个人总得分将大于或小于盘口指定的总分数线。",
					},
				},
				6: {
					title: "球员/球队得分 -大/小",
					desc: "",
					list: {
						0: "预测主场或客场的总比分是大于还是小于指定盘口。",
						1: "如果赛事中断，除非市场已经派彩或任何将来的得分不会影响到赛果的投注有效，其他所有注单一律视为无效。",
					},
				},
				7: {
					title: "波胆",
					desc: "",
					list: {
						0: "预测一个特定赛事全场的正确比分。",
						1: "结算将依据相关部门最终公布的比分为准。",
					},
				},
				8: {
					title: "单双",
					desc: "",
					list: {
						0: "预测在某一特定的时间段内比赛进行的总局数、盘数或分数是单数还是双数。",
					},
				},
			},
		},

		baseball: {
			title: "棒球",
			section: {
				0: {
					title: "一般规则",
					desc: "",
					list: {
						0: "所有投注的注单均在比赛结束后才被视为有效，除非另有注明。",
						1: "如果投注的球队没有参与比赛，所有投注此球队的注单（排除冠军盘口）将被取消。",
						2: "如果比赛场地有变更，所有注单将被取消。海外（到其他国家）所举办的热身交流赛，无主/客队之区别，注单仍视为有效。",
						3: "国际棒球比赛规则：如果比赛最少进行七局后有一队领先10分，或最少进行五局后有一队领先15分，赛事将会提早结束。如果遇此情况，所有的投注将继续保持有效，包括独赢盘丶让分盘（让垒盘）丶大/小盘（总比分）丶单/双盘。",
						4: "上半场投注是按照第1局到第5局的结果为准。",
						5: "下半场投注是按照第6局到第9局及加时（局）赛的结果为准，如遇下半场中断或延迟，并未在官方指定开球时间的36小时内复赛，所有该场赛事已有明确赛果的投注将予以结算，其馀视为无效。",
						6: "比赛结果以1-9局结束后为准。如果赛事在加时（局）赛时被保留或中断，将以当下比赛被保留时的比分为准。",
						7: "结算时，加时（局）赛将计算在内，除非另有注明。",
						8: "官网公布球赛之投手仅供参考，若开打时更换投手，注单仍视为有效。",
						9: "如果比赛提前开赛，仅接受开赛前所投注的注单视为有效投注。开赛后投注的注单将被视为无效投注，滚球玩法除外。",
						10: "如果比赛延期，所有投注均视为无效投注，除非另有注明。",
						11: "延长赛规则",
						"11_0": "a.美国职棒正规赛为1~9局，加时赛为无局数限制。",
						"11_1": "b.日本职棒正规赛为1~9局，加时赛为最高12局为限，最终输赢赛果可以为和。",
						"11_2": "c.韩国职棒正规赛为1~9局，加时赛为最高12局为限，最终输赢赛果可以为和。",
						"11_3": "d.台湾职棒正规赛为1~9局，加时赛为最高12局为限，最终输赢赛果可以为和。",
						"11_4": "e.美国职棒3A小联盟正规赛为1~9局，加时赛为无局数限制。",
						12: "所有玩法的投注，如若已有明确赛果，所有相关投注将予以结算。",
					},
				},
				1: {
					title: "投注类型",
					desc: "",
				},
				2: {
					title: "独赢（三项）",
					desc: "",
					list: {
						0: "预测哪一支球队将在比赛胜出或赛事和局。盘口提供两支球队以及和局为投注选项。",
						1: "赛事盘口包括全场（包含加时）、前五局或单局投注。",
					},
				},
				3: {
					title: "独赢（两项）",
					desc: "",
					list: {
						0: "预测哪一支球队将在指定阶段的比赛中胜出。但若比赛结果为平局，所有投注将被取消。",
						1: "赛事盘口包括前五局或单局投注。",
					},
				},
				4: {
					title: "胜负",
					desc: "",
					list: {
						0: "预测哪一支球队将在比赛胜出。盘口提供两支球队为投注选项。",
						1: "赛事盘口包括全场（包含加时）、前五局或单局投注。",
					},
				},
				5: {
					title: "让分",
					desc: "",
					list: {
						0: "预测哪一支球队在盘口指定的让分数赢得某个时节或全场比赛。",
					},
				},
				6: {
					title: "总分大小",
					desc: "",
					list: {
						0: "预测赛事总比分将大于或小于在盘口指定的大/小盘分数。",
						1: "全场（包含加时）结算时, 加时(局)赛将计算在内。",
						2: "如果赛事中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况，大/小盘注单才会被结算。若遇到任何其他情况，注单将一律被取消。",
						3: "如果赛事在上半场中断，所有注单将被取消，除非中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况注单才会被结算。",
						4: "如果赛事在下半场取消或中断，所有上半场注单保持有效。",
						5: "如果赛事在下半场取消或中断，所有下半场注单将被取消，除非中断前已有明确结果并且之后没有任何显著会影响赛事结果的情况注单才会被结算。",
						6: "滚球结算是以0-0的比分按盘口开出的大小盘让分数做裁决。",
					},
				},
				7: {
					title: "单双",
					desc: "",
					list: {
						0: "预测赛事的总比分是单数或双数。",
						1: "全场（包含加时）结算时, 加时(局)赛将计算在内。",
					},
				},
				8: {
					title: "球队总分大小",
					desc: "",
					list: {
						0: "预测指定的球队总跑垒得分将大于或小于盘口指定的大/小盘分数。",
						1: "全场（包含加时）结算包括加时赛局。",
					},
				},
				9: {
					title: "胜分差",
					desc: "",
					list: {
						0: "预测哪一支球队将赢得这场比赛并比他们的对手多多少。",
						1: "举例：A队最后得分是12，B队最后得分是8，那么“净胜分数”就是4。",
						2: "结算包括加时(局)赛。",
					},
				},
				10: {
					title: "比赛会有加时",
					desc: "",
					list: {
						0: "预测赛事是否超出常规9局时间（除非另有说明）。",
						1: "出于结算的目的，任何常规的比赛延长到第10局或更多，将被视为进入“加时赛”。",
					},
				},
				11: {
					title: "剩余时间获胜",
					desc: "",
					list: {
						0: "预测滚球时，哪一支球队在剩余的比赛时间胜出。",
						1: "投注的结算将以投注时至完场期间完场赛果为准。",
						2: "结算包括加时(局)赛。",
					},
				},
				12: {
					title: "安打大小",
					desc: "",
					list: {
						0: "预测赛事安打数量将大于或小于在盘口指定的大/小盘数。",
						1: "结算包括加时(局)赛。",
					},
				},
				13: {
					title: "主队安打大小",
					desc: "",
					list: {
						0: "预测主队安打数量将大于或小于在盘口指定的大/小盘数。",
						1: "结算包括加时(局)赛。",
					},
				},
				14: {
					title: "客队安打大小",
					desc: "",
					list: {
						0: "预测客队安打数量将大于或小于在盘口指定的大/小盘数。",
						1: "结算包括加时(局)赛。",
					},
				},
				15: {
					title: "全垒打大小",
					desc: "",
					list: {
						0: "预测赛事全垒打数量将大于或小于在盘口指定的大/小盘数。",
						1: "结算包括加时(局)赛。",
					},
				},
				16: {
					title: "独赢&大小",
					desc: "",
					list: {
						0: "同时预测比赛结果，以及赛事总分将大于或小于在盘口指定的大/小盘球数。",
					},
				},
				17: {
					title: "先得X分的队伍",
					desc: "",
					list: {
						0: "预测第一个获得X分的球队。",
					},
				},
				18: {
					title: "最高得分的局",
					desc: "",
					list: {
						0: "预测预定局数中，最高得分的局。",
						1: "比赛必须完成预定局数，否则投注将无效。",
						2: "当出现两局或者以上相同分数。将被视为“平等”获胜。",
					},
				},
			},
		},

		badminton: {
			title: "羽毛球",
			section: {
				0: {
					title: "一般规则",
					desc: "",
					list: {
						0: "所有注单都以全场赛事结束视为有效，除非另有注明。",
						1: "如果投注的球员没有参与比赛，所有投注此球员的注单（排除冠军盘口）将被取消。",
						2: "如果一名球员或组合在比赛未结束前退出或被取消资格，所有该场比赛的注单将被取消，除非另有注明。",
						3: "如果比赛持续时间缩短或比赛要求提高获胜比分，所有注单将被视为无效。",
						4: "如果比赛提前开赛，仅有在开赛的前投注的注单将为视为有效投注。开赛后投注的注单将被视为无效，滚球玩法除外。",
						5: "所有玩法的投注，如若已有明确赛果，所有相关投注将予以结算。",
					},
				},
				1: {
					title: "投注类型",
				},
				2: {
					title: "独赢",
					desc: "",
					list: {
						0: "预测哪个球员将会赢取比赛的胜利。此玩法包含双方球员。",
					},
				},
				3: {
					title: "让分",
					desc: "",
					list: {
						0: "预测在某个时节 哪一位球员在盘口指定的让分数赢得比赛。",
					},
				},
				4: {
					title: "总分大小",
					desc: "",
					list: {
						0: "预测在某个时节，比赛总得分将大于或小于盘口指定的总分数线。",
						1: "如果赛事中断，除非市场已经派彩或任何将来的得分不会影响到赛果的投注有效，其他所有注单一律视为无效。",
					},
				},
				5: {
					title: "局独赢",
					desc: "",
					list: {
						0: "预测哪个球员将会赢取指定局的胜利。",
					},
				},
				6: {
					title: "第X分的球员",
					desc: "",
					list: {
						0: "预测哪一位球员在指定局中获得总分的第X分。(例如第5分的球员）",
						1: "如果一名球员退出或被取消资格，没有最终获胜者的所有注单将被取消，已结束的注单将视为有效。",
					},
				},
				7: {
					title: "正确比分",
					desc: "",
					list: {
						0: "预测一个特定赛事全场的正确比分。",
						1: "结算将依据相关部门最终公布的比分为准。",
					},
				},
				8: {
					title: "局单双",
					desc: "",
					list: {
						0: "预测指定局的总分数是单数还是双数。",
					},
				},
			},
		},
	},

	// 注单记录
	betRecord: {
		未结算: "未结算",
		已结算: "已结算",
		查询: "查询",
		此记录将显示所有未派彩的投注: "此记录将显示所有未派彩的投注",
		总计单数: "总计单数",
		总投注额: "总投注额",
		"输/赢": "输/赢",
		编号: "编号",
		投注详情: "投注详情",
		投注玩法: "投注玩法",
		选项: "选项",
		投注额: "投注额",
		派彩金额: "派彩金额",
	},

	// 赛果
	results: {
		搜索: "搜索",
		滚球: "滚球",
		搜索联赛: "搜索联赛",
		搜索赛事: "搜索赛事",
	},
};
